<template>
  <div class="baoxiao box">
    <p v-for="(item,index) in bx" :key="index">{{ item }}</p>
<!--    <Baoxiaos/>-->
<!--    <Baoxiaos></Baoxiaos>-->
  </div>
</template>
<style>
.baoxiao{
    width: 100%;
    height: 90%;
    overflow: auto;
    background-color: lightgoldenrodyellow;
}
.baoxiao p{
    width: 90%;
    height: auto;
    margin: 1rem auto;
    font-size: 0.9rem;
    text-align: left;
    background-color: lightblue;
    border-radius: 5%;
}
</style>

<script>
// @ is an alias to /src
// import Baoxiaos from '@/components/Baoxiaos.vue'

export default {
  name: 'baoxiao',//组件名
  components: {
    // Baoxiaos,
  },
  data:function () {
    return {
       bx:[
         "一个男生暗恋一个女生很久了。一天自习课上，男生偷偷的传了小纸条给女生,上面写着“其实我注意你很久了”。不一会儿，女生传了另一张纸条，男生心急火燎的打开一看“拜托你不要告诉老师，我保证以后再也不嗑瓜子了。。。”男生一脸懵逼。",
         "有一次和男友吵架了在电话里哭，闺蜜来安慰我，突然，他盯着我的眼睛看。冒出一句：“你的睫毛膏用的什么牌子的，这么哭成这B样，都没掉”。我真是气打不一处来，电话一扔也不哭了。",
         '昨天因为一件事骂儿子，说你妈妈是猪，你也是头猪。儿子却反过来说我：爸爸你怎么这么衰，娶了一头猪，还生了一只猪！你说你这熊孩子，这是不是找打。',
         '相亲见面会上，她侃侃而谈，说她以前的男友如何开豪车，住豪宅，经常夸她如何如何漂亮，一看到她就紧张。他看了看她：“我，我一般看，看到美女，也，也会紧张的说，说不出话来。”她噗嗤一笑：“你这种搭讪的方式真老土。”“但，但看到不，不好看的，就，就会结巴。”那女的立马脸变成了猪肝色',
         '跟老公聊天聊到夫妻相，我说：“夫妻在一起生活时间久了，吃一样，住一起。久而久之，就长夫妻相了。他如有所悟的道：“哦，怪不得我越来越丑了！ ”',
         '有次牙痛去看医生，医生说我的牙有点磨损，问我晚上睡觉磨不磨牙？我说不知道啊，睡着了怎么能知道自己是不是磨牙埃,医生说：奥，单身埃',
         '老爸经常对我说：“孩子你要多读书，所谓行千里路，读万卷书。读书破万卷，下笔如有神，书是人类进步的阶梯。。。(此处省略5000字)”后来我长大了，听到别人说“人丑就要多读书”，才明白老爸真是用心良苦！！！',
         '昨晚跟麻麻讲电话，妈妈又开始念经了，让我今年要么带对象回家过年，要么跟对象回他家过年，不然后果自负！我想了想，跟妈妈说：“那没辙了，我想人家动物园也不能同意啊！ ”',
         '闺蜜牙疼，决定把这颗病牙拔了。我陪着捂着腮帮子哼哼唧唧的闺蜜去了附近牙科小诊所。牙医大哥给闺蜜检查的时候，闺蜜痛的大声啊埃。。大哥擦擦头上的汗，对我说：你出去叫几个街坊邻居过来，你嫂子不在家，我害怕误会。',
         '枸杞爱上菊花，眼镜就亮了。”“骗人，枸杞塞到菊花里，眼晴也没感觉亮埃”“别人眼前会一亮啊！！！ ”'
       ]
    }
  }
}
</script>