<template>
  <div class="gaoxiao box">
    <p v-for="(item,index) in gx" :key="index">{{ item }}</p>
  </div>
</template>
<style>
.gaoxiao{
    width: 100%;
    height: 90%;
    overflow: auto;
    background-color: lightgoldenrodyellow;
}
.gaoxiao p{
    width: 90%;
    height: auto;
    margin: 1rem auto;
    font-size: 0.9rem;
    text-align: left;
    background-color: lightblue;
    border-radius: 5%;
}
</style>

<script>
// @ is an alias to /src
// import HelloWorld from '@/components/HelloWorld.vue'

export default {
  name: 'gifCon',//组件名
  components: {
    // HelloWorld
  },
  data:function () {
    return {
      gx:[
              '母亲：“明明，你上学有三个多月了，你觉得语文和数学哪一门好学些呢？”明明：“数学好学。”母亲：“为什么？”明明：“因为语文生字多，数学只有0到9十个数字。”',
              '小明数学不好，被父母转到一间教会的学校，半年后数学成绩全A，妈妈问：“是修女教得好？是教材好？是祷告？...” “都不是”小明说：“进教的第一天，我看见一个人被钉死在加号上面，我就知道...他们是玩真的！ ”',
              '离婚证有什么用呢？”“多一个证，无论是应聘还是面试的时侯，总能为自己带来一点底气与自信！ ”',
              '刚刚小李看了一下工资存折，不由得唱起了《黄梅戏》。“这么高兴，钱剩很多？”“不，他唱的是：我的工资又在何方！ ”',
              '“有没有那种天上掉钱的工作？”“有啊！ ”“啥工作？”“许愿池里当王八呗！ ”',
              '陪老婆回娘家，恰逢小姨子23岁生日，我发了23块钱红包，她说我抠门。后来丈母娘在厨房对小姨子说：“以后不要这样说你姐夫，他抠门是因为没钱，而他没钱是因为娶了你姐埃”',
              '一觉醒来头重脚轻，晕的厉害。“妈，我头疼，好像感冒了。。。”“快快快，把药吃了！ ”老妈火速端水拿药“等会儿你表姐她们要来咱家玩，还指望你做饭呢！ ”',
              '小明数学不好，被父母转到一间教会的学校，半年后数学成绩全A，妈妈问：“是修女教得好？是教材好？是祷告？...” “都不是”小明说：“进教的第一天，我看见一个人被钉死在加号上面，我就知道...他们是玩真的！ ”',
              '数学课上，小明趴在桌子上睡觉，数学老师没有发觉，还在滔滔不绝地讲课。下课了，小明醒来，问同桌的数学课代表：我睡了多久了？数学课代表说：你已经睡了一节课，大概2400秒，40分钟，三分之二小时，三十六分之一天，一千零八十分之一个月，一万二千九百六十分之一年，一百二十九万六千分之一世纪了吧！',
              '宝宝数学很好，2岁就可以从1数到10了。后来，我告诉他0比1还校。今天吃饺子，我说：“宝宝，你数数你想吃几个饺子？”“0，1，2，3……”一边说一边拿起一个饺子，“这是第0个。”老婆怒吼：“下一代还是做程序员的命！ ”'
      ]
    }
  }
}
</script>