<template>
  <div class="hh box">
      <p v-for="(item,index) in hh" :key="index">{{ item }}</p>
  </div>
</template>
<style>
.hh{
    width: 100%;
    height: 90%;
    overflow: auto;
    background-color: lightgoldenrodyellow;
}
.hh p{
    width: 90%;
    height: auto;
    margin: 1rem auto;
    font-size: 0.9rem;
    text-align: left;
    background-color: lightblue;
    border-radius: 5%;
}
</style>

<script>
// @ is an alias to /src
// import HelloWorld from '@/components/HelloWorld.vue'

export default {
  name: 'gifCon',//组件名
  components: {
    // HelloWorld
  },
  data:function () {
        return {
            hh:[
                '“国师，朕今早上起来，发现传国玉玺竟少了一个角。玉玺乃一国之宝，象征江山社稷，国师，现在它碎了一个角，这说明了什么呢？”国师：“陛下，这说明您没拿稳。”',
                '有个酒鬼，酒瘾甚大，每天不喝个一半斤的，日子根本没法过。可自从他到一家酒铺买酒喝后，他现在竟然把酒戒掉了。这天，他买了礼品，高兴的来到这家酒馆，前来道谢。店老板惊讶的问：“你买酒，我卖酒，有什么好谢的。”酒鬼一脸严肃的说：“当然要谢！这几年要不是你循序渐进的往卖给我的酒里掺水，我现在怎么可能戒酒啊！现在，我在家喝杯水就可以过酒瘾了。”',
                '三个人在学校门口接孩子，开车的说：孩子现在也接不起了，住的远，一天油钱也得十多块，费油埃骑电动车的说：谁说不是呢，我这一个月电费也得二三十块，费电埃骑自行车的说：我这不费油，不费电的，天天还可以锻炼身体，不过啊，也花钱，天天吃的多，费饭埃',
                '白雪公主与王子的结婚纪念日，王子拿出一件礼物对公主说：“我的公主，这是今年最潮最时尚的电子产品，满大街的人都爱疯了。”公主拆开礼物一看，“啪”的一声就把礼物摔到王子脸上，一手叉腰，一手指着礼物上那个缺了一块的logo标志破口大骂：“md，你不知道老娘当年差点被苹果噎死啊',
                '小王带着小儿子去湖边玩。儿子问：“爸爸，为什么月亮只剩一半了？”小王支支吾吾半天，突然说：“你没看到另一半在湖里吗？”',
                '把孩子们打发上床后，母亲换上了一条旧裤子和一件松松垮垮的上衣，开始洗头。当听到孩子们的打闹声越来越响时，她越来越不耐烦起来。最后她在头上胡乱缠了条毛巾，吼叫着冲进了孩子们的房间，严厉地训斥着命令他们躺回床上。当她离开房间时，她听见三岁的女儿颤抖着声音说：“刚才是谁啊？',
                '儿子：家长会上老师表扬我了吗？爸爸：没有，听了半天也没有听到你的名字。儿子：那老师念完表扬的同学的名字后说等等了吗？爸爸：说了。儿子：那就是表扬我了，我一般就在等等里头。',
                '孩子：“妈妈，我们是上帝养活的吗？”妈妈：“当然喽，亲爱的。”孩子：“礼物也是上帝发的？”妈妈：“那还用说。”孩子：“那要爸爸干什么，只在家吃饭吗？”',
                '幼儿园里，有二个小男孩在吵架，越吵越凶。其中一个大声嚷嚷：“我回去叫我爸爸打你爸爸的脑袋。”另一个小孩大声笑道：“哈!哈!你才打不到呢!我妈妈说，我爸爸跟本就没有脑袋!”',
                '小学一年级的小丽拿个新书包回家。她对妈妈说：“这是老师发给我的奖品。”妈妈问小丽：“为什么给你发奖？”小丽说：“因为老师问马有几条腿，我说有五条。”“可一匹马只有四条腿呀。”妈妈说。小丽说“我知道。可其他同学都说马有六条腿，我是最接近正确答案的一个。”'
            ]
        }

    }

}
</script>