<template>
  <div class="kongbu box">
    <p v-for="(item,index) in kb" :key="index">{{ item }}</p>
  </div>
</template>
<style>
.kongbu{
    width: 100%;
    height: 90%;
    overflow: auto;
    background-color: lightgoldenrodyellow;
}
.kongbu p{
    width: 90%;
    height: auto;
    margin: 1rem auto;
    font-size: 0.9rem;
    text-align: left;
    background-color: lightblue;
    border-radius: 5%;
}
</style>

<script>
// @ is an alias to /src
// import HelloWorld from '@/components/HelloWorld.vue'

export default {
  name: 'gifCon',//组件名
  components: {
    // HelloWorld
  },
  data:function () {
    return {
      kb:[
              '早先，老有些不干净的东西混进深夜运营的电车，很多在上面的小孩儿都被吓哭过。后来公交公司请了有本事的道士解决了这个问题。有鬼电车退出了历史舞台，路上跑的全部都是无鬼电车。',
              '刚才不小心看到了某条“不转死全家”的贴子……犹豫了一下还是坐在电脑椅上转了一圈……挺方便的……还缓解了疲劳……',
              '闪电后，教室的灯全熄了。黑暗中小白感觉有东西接近他。没等回过神，双臂就被紧紧箍住，对方的牙齿已经凑了过来。“我完了。”想起学校里吸血鬼的传言，他绝望地闭上了眼。许久，小白感到对方一步步离开。远处传来一个阴沉的声音：“操！没见过这么胖的，连脖子都没有！ ”',
              '有一个男生晚上要坐公车回家,可是因为他到站牌等的时候太晚了,他也不确定到底还有没有车....又不想走路.因为他家很远很偏僻,所以只好等着有没有末班车....等啊等啊....  他正觉得应该没有车的时候,突然看见远处有一辆公车出现了....他很高兴的去拦车. 一上车他发现这末班很怪,照理说最后一班车人应该不多,因为路线偏远,但是这台车却坐满了...只有一个空位,而且车上静悄悄地没有半个人说话..... 他觉得有点诡异,可是仍然走向那个唯一的空位坐下来,那空位的旁边有个女的坐在那里,等他一坐下,那个女的就悄声对他说:"你不应该坐这班车的," 他觉得很奇怪,那个女人继续说:"这班车,不是给活人坐的......" "你一上车,他们(比一比车上的人)就会抓你去当替死鬼的."  他很害怕,可是又不知道该怎么办才好,结果那个女的对他说:"没关系,我可以帮你逃出去." 于是她就拖着他拉开窗户跳了下去,当他们跳的时候,他还听见"车"里的人大喊大叫着"竟然让他跑了"的声音..... 等他站稳时候,他发现他们站在一个荒凉的山坡,他松了一口气,连忙对那个女的道谢. 那个女的却露出了奇怪的微笑:" "现在,没有人跟我抢了......."',
              '大概六年前，有一天村子里来了一各老人，老人看起来非常憔悴失意，可是没有人认识他所以也没去注意，结果傍晚时老人被人发现在竹林里上吊自杀了，而自杀的地方就是正好在我家後面的竹林，透过浴室的窗户正好可以很清楚的看见老人。因为距离大概不超过十步，後来我晚上回来了，因为尸体很快就被处理掉了，所以我并不知道。然後我记得那一天我的心情非常好，很高兴的就去洗澡了，因为我们家的浴室非常小，所以洗澡时人是非常靠近气窗的。就当我洗到一半时，我不经意的一抬头，正好面对著气窗，当时看到的景象让我整个人都僵掉了。因为我看到的是一个“人头”，当时我已经不会动了，而那个人头却一直眼睁睁的看著我，然後他就开始对我笑……并且说了一句话，他说：“……哥，你有没有吓一跳？” ',
              '夜深了，两个男子走在路上开始谈论起鬼来。其中一个说：“有些人活着的时候就够吓人的了，死了之后还要吓人。听说天黑了以后这条街上会有个鬼出现，那个鬼长得丑死了，有好几个胆小的女孩子都被他吓晕过，并且他以吓人为乐。”这时，突然从他们后面传出话来：“是哪个家伙在说我的坏话？”',
              '我有一个朋友，他有一个三岁左右的小儿子，有一日他发现，他儿子在窗口一边挥手一边讲：伯伯再见!朋友最初不以为然，以为儿子在跟街上路过的阿伯讲话，但是又觉得他儿子每次都是黄昏左右才这样讲，哇……但又看不到窗外有人……朋友越想越害怕……于是就问儿子和谁说再见啊！儿子回答：跟伯伯！朋友又问：外面没人啊!你跟哪个伯伯讲呀？儿子一边指着外面一边回答他说：哪一个伯伯？太阳伯伯啊！'
      ]
    }
  }
}
</script>