<template>
  <div class="mingzhu box">
    <p v-for="(item,index) in mz" :key="index">{{ item }}</p>
  </div>
</template>
<style>
.mingzhu{
    width: 100%;
    height: 90%;
    overflow: auto;
    background-color: lightgoldenrodyellow;
}
.mingzhu p{
    width: 90%;
    height: auto;
    margin: 1rem auto;
    font-size: 0.9rem;
    text-align: left;
    background-color: lightblue;
    border-radius: 5%;
}
</style>

<script>
// @ is an alias to /src
// import HelloWorld from '@/components/HelloWorld.vue'

export default {
  name: 'gifCon',//组件名
  components: {
    // HelloWorld
  },
  data:function () {
    return {
      mz:[
              '悟空向铁扇公主借芭蕉扇的时候，刚好是牛魔王下班回来。牛魔王在家门口听见了如下的对话：悟空：“嫂嫂，我在你里面了１铁扇公主：“啊！不要！！！啊！！！痛！！！你不要乱动。啊，求你快点出来吧！！！埃。。。”悟空：“好，我就要出来了！请嫂嫂张开嘴巴！！１铁扇公主：“蔼———”牛魔王听到这里，在家门口留下一封离婚协议，伤心的走了。',
              '曹操：快快打探，我方还剩多少人马?蒋干：只剩高校学生那么多了!曹操：哈哈，天无绝人之路啊，我们尚可一战，再去打探!蒋干：哎呀主公不好，我方人马只剩高校mm那么多了！曹操(跌坐)：天亡我也，看来只能速速北归了，快快再去打探！蒋干(一会，干回来伏曹身上痛哭)：555……曹操：如何？蒋干(哽咽)：主公，我方兵马只剩高校ppmm那么多了！曹操仰天长叹：嗨，这样说来，我方已全军覆没了…速速逃命吧。。。',
              '师徒4人走在路上，唐僧抬头看看太阳已经中午了，回头对悟空说：“去给老子弄点酒肉来，好几天没碰到妖怪了，你去捉几个来下酒，这几天嘴里都淡出鸟来了。”',
              '一日军中无事，刘关张三兄弟大帐闲聊。关羽说：“大哥三弟，我感觉咱们和西游记里面的人差不多。我脸红红的像悟空，三弟满脸胡子像沙僧。”刘备摸摸自己的耳朵大骂：你给我滚出去！！',
              '展昭：“包大人，你额头的月牙是怎么弄的？”包青天：“天生的。”展昭：“揭得下来吗？”包青天：“天生的。揭不下来。”展昭：“如果揭下来呢？”包青天：“揭下来…………揭下来就是见证奇迹的时刻……”',
              '唐僧师徒途径女儿国，国王恋上三藏，坚决不肯放其过关。“长老姓唐，甜到哀伤。若你们能找来更甜的和尚，便放他离去。”她对师兄弟几人如是说。“这有何难。”沙僧翻身跳上白龙马，一时间竟连空气都香甜起来。女王大?澹??屎喂省?br>沙僧冷笑道：“那么大人了，都不知道‘沙骑马’很甜的么？',
              '唐僧走出女儿国时，女儿国国王不舍地亲自为唐僧送行。唐僧深情地拉着女王的手，又难过地望了望几个非常丑的几个徒弟，对着女王失落地唱道：“可惜不是你，陪我到最后……”',
              '郭靖在终南山上，碰到了霍都。霍都说：“如果你在十招之内夺我扇子，就算你赢。”郭靖答应了。霍都大笑三声，把扇子撕了。',
              '魏延向诸葛亮贡献子午谷奇谋，诸葛坚决不给兵。魏延心有不甘，遂决定带自己家的亲兵、厨子、裁缝、奶妈、园丁自己去打。没等出发呢，诸葛就扑过来抱住他的大腿，死活不放。魏延怒了：“丞相，我都不用你的兵了你咋还不准，你有病吧？”诸葛微微点头：“嗯。”，然后双颊绯红地说：“拖……延……症。”',
              '孙悟空找玉帝去闹：“我当弼马温是多大的官呢，今天才知道，原来就是马夫。我这么大能耐，你让我给你养马？这不是欺负猴儿吗？”太白金星赶紧拦住他，附耳说道：“知足吧。刚参加工作就能养马已经很不错了，你看那边那个太上老君没，多少年了啊，到现在还在烧锅炉。'
      ]
    }
  }
}
</script>