<template>
  <div class="neihan box">
    <p v-for="(item,index) in nh" :key="index">{{ item }}</p>
  </div>
</template>
<style>
.neihan{
    width: 100%;
    height: 90%;
    overflow: auto;
    background-color: lightgoldenrodyellow;
}
.neihan p{
    width: 90%;
    height: auto;
    margin: 1rem auto;
    font-size: 0.9rem;
    text-align: left;
    background-color: lightblue;
    border-radius: 5%;
}
</style>

<script>
// @ is an alias to /src
// import HelloWorld from '@/components/HelloWorld.vue'

export default {
  name: 'gifCon',//组件名
  components: {
    // HelloWorld
  },
  data:function () {
    return {
      nh:[
              '朝鲜士兵日记：今天，伟大的天降伟人金元帅来到前线，他拿起新式望远镜观察敌情，久久不肯放下。过了一会儿，他放下望远镜笑着说：这个望远镜望得太远了，我的目光居然绕了地球一圈，看到了自己的后脑勺。这需要改进，改成能调距离的，不然的话，这种望远镜一旦装在我们的狙击步枪上，会伤到自己人的。',
              '仙风道骨的真人正与弟子讲述当年武林纷争中自己经历的一场生死决战，“……就在千钧一发之际，我一个鲇鱼打挺，躲过那索命一击…”弟子打断：“师傅，不是鲤鱼打挺么？”真人用手捋了捋仙须，缓缓说道：“鲇鱼要形象一些。”',
              '问：穿过皮鞋没？答：没。问：吃过皮鞋没？答：经常吃',
              '白雪公主结婚以后，身体一直不太好。王子请来医生诊断，发现她居然只剩下一个肾。王子悲伤地捧起她的脸：“亲爱的，你到底遭遇了什么？”白雪公主勉强露出一个微笑：“我在森林隐居时，有一天，一个巫婆敲开门对我说：“孩子，来个苹果吧!',
              '一副扑克一起出去玩，玩到中午都饿了。大王说谁去弄点吃的吧，结果五十四张牌你推我，我推你，最后红桃六说：我建议让梅花三去弄吃的！梅花三跳起来大叫：为什么是我？！红桃六说：梅花三弄啊？!',
              '有网友问：皇上，您还记得当年大明湖畔的夏雨荷嘛？最佳答案：记的，价格很便宜，网友都说她技术很好。',
              '某女会计向厂长请假。厂长问：“你怎么每个月这时候都要请假？请假干嘛？”女会计说：“家里来客了。”厂长很好奇，问：“什么客人？”女会计犹豫了一会儿说：“娘家人。”厂长继续追问：“谁呀？怎么每月都来？”女会计红着脸说：“刘洪水。”厂长一拍大腿：“刘洪水是我表哥啊，不行，我得去陪陪他。”',
              '有个人死后，来到了地狱，地狱里面很热。但他看到地狱里面有一个很漂亮的美女，身旁还放着一瓶上等的美酒，他回头对小鬼说：“原来地狱这么美好，又有美酒，又有美人。”小鬼道：“你只知其一，不知其二埃这瓶美酒的底下有个洞，你喝不到，而那美女却没有。”',
              '早上去上班，一美女看见一男的拉链没拉，于是偷偷地给拉上了，谁能想到，全车的男人都偷偷的把拉链拉开了。。。',
              '某人找领导办事，拿出五张美女照片给领导让任其选一张：“您中意哪个？” 领导看了看没说话，那人急了：“您表个态呀！ ”领导坏笑：“你见到地上有五张百元大钞会捡哪张？”',
              '老王问小李为什么眼睛肿了。小李说：今天早上我穿裤子的时候，一颗扣子掉了，我不会缝，所以就跑到隔壁去，要一位太太帮我缝上。天哪！她一定认为你太过分，而给你一个拳头！不，不是这样！她人很好，当场就拿出针线缝了起来我也站著给她缝，可是就当她缝完，用嘴把线咬断时，她老公进来了！',
              '经理遇清洁女工清扫电梯。女工：经理，你先上我再拖。经理：还是你先拖我再上。几番推脱，经理：咱们边拖边上，边拖边上啊!',
              '一个富翁在做腹部手术之前，特意请人做了一套纯金手柄的手术器械，并对医护人员讲：“诸位，这些刀剪以后就留给你们作纪念吧。”富翁想，这下他们肯定会把手术做好，并且不用提心把什么东西忘到自己肚子里去了。手术进行到一半，主刀医生大怒：“手术器械都去那里了，我手术还没做完呢!'
      ]
    }
  }
}
</script>