<template>
  <div class="shunkouliu box">
    <p v-for="(item,index) in skl" :key="index">{{ item }}</p>
  </div>
</template>
<style>
.shunkouliu{
    width: 100%;
    height: 90%;
    overflow: auto;
    background-color: lightgoldenrodyellow;
}
.shunkouliu p{
    width: 90%;
    height: auto;
    margin: 1rem auto;
    font-size: 0.9rem;
    text-align: left;
    background-color: lightblue;
    border-radius: 5%;
}
</style>

<script>
// @ is an alias to /src
// import HelloWorld from '@/components/HelloWorld.vue'

export default {
  name: 'gifCon',//组件名
  components: {
    // HelloWorld
  },
  data:function () {
    return {
      skl:[
              '啊哈～给我一杯望轻水，换我一生不减肥。',
              '挖个抗埋点土，把我的思念种进去。数个12345，不长花不长草，就长红钞票。谁说感情不上税，想你还得花一毛呢.',
              '国庆乐坏了灰太狼，老婆给放假不用抓羊。带着妻儿去旅行，去了三亚晒太阳。我把消息告诉你，放心吃喝放心睡，你这幸福的懒羊羊。',
              '李白：床前明月光，有饼没包装。举头望明月，低头闻饼香。',
              '房：老百姓愁住房，开发商愁售房，企业家愁帐房，制片人愁票房，当官的愁二房，贪赃的愁班房，男人愁私房，女人愁乳房，老人愁心房，打工的愁租房，住院的愁病房，分娩的愁产房，结婚的愁新房，小市民愁拆房。哎！房事可真够愁人的！',
              '对公司的看法：远看像天堂，近看像银行，进去像牢房，不如回家放牛羊。个个都说好，个个都往那里跑，这里挣钱这里花，哪有钞票寄回家。都说这里工资高，害得我没钱买牙膏；都说这里伙食好，青菜里面加青草；都说这里环境好，蟑螂蚂蚁四处跑；都说这里领班帅，个个平头像锅盖。年年打工年年愁，天天加班像只猴，天天挨骂无理由，碰见老板低着头。发了工资摇摇头，到了月尾就发愁，不知何年才出头？',
              '你和他讲道理，他和你耍流氓；你和他耍流氓，他和你讲法制；你和他讲法制，他和你讲政治；你和他讲政治，他和你讲国情；你和他讲国情，他和你讲接轨；你和他讲接轨，他和你讲文化；你和他讲文化，他和你讲孔子你和他讲孔子，他和你讲老子；你和他讲老子，他给你装孙子！',
              '猪的四大理想：四周栏杆都烂掉，天上纷纷下饲料，世上屠夫都死掉，全国人民信回教.',
              '看美女的时候：妖艳的是美女，丑陋的是有气质，牛逼的叫才女，木讷的叫淑女，瘦子叫苗条，胖子叫丰满，高个的叫婷婷玉立，矮个的叫小巧玲珑；蔫的叫温柔，凶的叫泼辣，傻的叫阳光，狠的叫冷艳，土的叫传统，洋的叫潇洒，匪的叫另类，骚的叫风流，嫩的叫青春靓丽，老的叫风韵犹存，浪的叫众星捧月，牛的叫傲雪凌风，闲的叫感情专一，忙得叫追求自我，烦的叫循循善诱，损的叫拒绝成熟，弱不禁风的叫有女人味，不象女人的叫超女。',
              '啥礼物不能明着送？秋波，暗送秋波嘛！哪个季节最忙？秋天，多事之秋嘛！啥时候最公平？秋天，一叶知秋嘛！什么季节最短？秋天，一日不见，如隔三秋！',
              '四大虚：老板的肾，当官的稿，小姐的眼泪，统计局的表。',
              '四大闲：大款的老婆，领导的钱，下岗职工，调研员。',
              '四知：到了北京才知道官小，到了上海才知道楼小，到了深圳才知道钱少，到了包厢才知道老婆太老',
              '四讲：上午讲正气，中午讲义气，下午讲手气，晚上讲力气。',
              '人生四大悲：久旱逢甘雨，一滴；他乡遇故知，债主；洞房花烛夜，隔壁；金榜提名时，重名。'
      ]
    }
  }
}
</script>